package org.example.lessons.lessons04

import java.lang.Boolean.FALSE
import java.lang.Boolean.TRUE

val v1: Int = 42
val v2: Long = 98765432123456789L
val v3: Float = 23.45f
val v4: Double = 0.123456789
val v5: String = "Kotlin & Java"
val v6: Boolean = FALSE
val v7: Char = 'c'
val v8: Short = 500
val v9: Long = 4294967296L
val v10: Float = 18.0f
val v11: Double = -0.001
val v12: String = "OpenAI"
val v13: String = "true"
val v14: List<Int> = listOf(3, 14)
val v15:Char = '9'
val v16:Int = 2048
val v17:Long = 10000000000L
val v18:Set<String> = setOf("OpenAI", "Quantum Computing")
val v19:Float = 5.75f
//Некорректные кавычки
// val v20:Any = `1.414`
val v21:String = "Artificial Intelligence"
//В массиве должны быть одинаковые типы
// val v22:Array<Char> = arrayOf('x', "A")
val v23:String = "Android Studio"
val v24:Char = '@'
val v25:Short = 1024
val v26:Long = 1234567890123L
val v27:Float = 10.01f
val v28:Double = -273.15
val v29:String = "SpaceX"
val v30:Boolean = FALSE
val v31:Double = 0.007
//Некорректные кавычки
// val v32:Char = “🤯”
val v33:Map<String,Int> = mapOf("true" to 2, "false" to 34)
//Некорректные кавычки
//val v34:Any =‘65535’
val v35:Long = 72057594037927935L
val v36:Float = 2.71828f
val v37:Double = 101.0101
val v38:String = "Quantum Computing"
val v39:Map<Int,String> = mapOf(2 to "true", 34 to "false")
val v40:Char = 'x'
val v41:Int = 314
val v42:Long = 123456789123456789L
val v43:Float = 6.626f
val v44:Boolean = TRUE

//1. Хранить букву, на которую указывает палец медиума во время спиритического сеанса.
val v45: Char = 'J'
//2. Хранить количество ложек сахара, которые я кладу в одну чашку чая.
val v46: Byte = 2
//3. Хранить список расходов на доставку еды, чтобы ещё раз убедиться, что готовить было дешевле.
val v47: Array<Double> = arrayOf(2342.353, 2324.234, 24.3675)
//4. Хранить длину очереди в столовой до миллиардной доли сантиметра.
val v48: Double = 32.234235466586
//5. Хранить факт, закрыт ли баг после того, как его просто переименовали в фичу.
val v49: Boolean = true
//6. Хранить количество свистков чайника за день.
val v50: Byte = 4
//7. Хранить количество нажатий котом на клавиатуру ноутбука за всё время твоей работы.
val v51: Long = 2_234_342_242_342L
//8. Хранить количество попыток пересчитать звёзды на небе за всю историю человечества.
val v52: Int = 654233
//9. Хранить массу воздуха в спускающем матрасе после нападения кота в долях грамма.
val v53: Double = 1.35335
//10. Хранить словарь «название стартапа → сумму потерь инвесторов».
val v54: Map<String, Double> = mapOf("Theranos" to 613.24247657432, "WeWork" to 40.34623445646455)
//11. Хранить строку «починилось само», чтобы закрывать тикеты без лишних слов.
val v55: String = "починилось само"
//12. Хранить список тем для митингов, которые на самом деле никому не нужны.
val v56: List<String> = listOf("", "")